/*Өгөгдлийн төрөл болон хувьсагч
5 Төрлийн Өгөгдлийн талаар тэдгээрийн хувьсагчийн талаар үзэх 

 - varable - хувьсагч өгөгдөл хадгалдаг сав гэж ойлгож болно.  Тоо тестийг түр хадгалж байгаад дараа нь тэр хувьсагчуудаар прорамчилдаг. 
 - хувьсагчийн нэр $ , _ болон цагаан толгойн үсгээр эхэлж бичихийг зөвшөөрнө. 
 - javascript - ийн түлхүүр үг хувьсагч нэрлэж болохгүй 
 - Олон үгээс тогтох нэрийг CamelCase ашиглан бичнэ. 

 var гэдэг түлхүүр үг 

var a ----> а гэдэг хувьсагч зарлаж байна. 
а = 23 ---> утганд 23 хадгалаа

-coersion --- javascript -ийн өгөгдлийн төрлийг автоматаар хөрвүүлэх  


 javascript primitive өгөдлийн төрөл 

 Number: Тоон  өгөгдөл хадгална. javascript-д бүх тоог бутархайгаар цаанаа хадгалдаг
 String: Тест өгөгдөл хадгална 
 Boolen: Үнэн эсвэл худал гэсэн өгөгдөл хадгална. True / Flase 
 Undefined : Хувьсагчийг зарлаад утга өгөөгүй тохиолдолд 
 Null : прорамист энэ хувьсагчид утга өгөөгүй гэж тэмдэглэх үеддээ энэ утгийг өгдөг 

 https://docs.emmet.io/cheat-sheet/*/
