// learn 11 Гурвалсан оператор,  ?, :

var name = "Болд";
var age = 12;
if (age >= 18) console.log(name + " бол насанд хүрсэн хүн  ");
else console.log(name + " бол хүүхэд");
// нэг үе явж байгаа бол { } бичихгүй байж болдог
// -------------------хххххх--------------------------------

// if нөхцөл шалгалтыг нэг мөрөнд бичиж болдог байгаа
var name = "Нараа";
var age = 22;
age >= 18 /* байхын бол ? энэ тэмдэгтээр*/
  ? console.log(name + " бол насанд хүрсэн хүн ") /*Үгүй бол : энэ тэмдэгтээр */
  : console.log(name + " бол хүүхэд ");
// Билегдэж true байгааг нь : ? энэ тэмдэгтээр
// Билегдэхгүй false байгааг нь : ? энэ тэмдэгтээр
// -------------------хххххх--------------------------------

// Энэ жишээ бол бүр товчилсон хэлбэр
// Гурвсан оператор маань нөхцөл шалгаад утга олгодог боломжийг өгдөгөөрөө if else ээс илүү давуу талыг өгдөгөөрөө ялгаатай.
var name = "Саранцэцэг";
var age = 55;
var who = age >= 18 ? " том хүн " : "хүүхэд";
// биелсэн тохиолдолд  who === "том хүн"  биелээгүй тохиолдолд "хүүхэд";
who === "том хүн"
  ? console.log(name + "бол бааранд орж болно ")
  : console.log(name + " бол бааранд орж болохгүй  ");
// Хэрвээ  гурвсан оператор ашиглаагүй бол
var name = "Ганаа";
var age = 56;
if (age >= 18) {
  var who = " том хүн ";
} else {
  var who = "хүүхэд";
}
who === "том хүн"
  ? console.log(name + "бол бааранд орж болно ")
  : console.log(name + " бол бааранд орж болохгүй  ");
