// learn 14 Функцтэй танилцацгаая statment бичиглэл

// Функц бол хэсэг бүлэг дахин дахин давтагддаг үйлдлийг багцалж нэг болгоод тэрийг энл тэнд copy past хийхээ болиод, тэр функцандаа нэр өгөөл дарааа нь функцынхаа нэрээр дуудаад дуудаад ажлуулчихдаг.
// бусад хэлний функцаас javascript хэлний функц маш өөр. javascript хэлний функцыг 1 зэрэглэлийн функц first class function ягаад вэ гэдэг талаар удахгүй үзнэ.
// ----------switch ашиглаж ямар мэргэжилтэй хүн ямар ажил хийдгийг олсон -------------------
// Dry Dont Repeat Yourself нь copy paste хийхгүйгээр програмчилах
// функцыг function гэдэг толхүүр үгээр бичдэг.
// argument
//()энд функцад дамжуулах өгөгдөл бичигдэнэ
// function функынНэрЭндБичигдэнэ() {
//   colsole.log("Энд функцын код бичигдэнэ.");
//   colsole.log("Фнкц ашиглан бид давхардсан үйлдлүүдийг хялбар болгодог.");
// }
// функынНэрЭндБичигдэнэ();

// arguments д байгаа дараалалаар таслал тавиад нь хийдэг.
medeelel("Болд", "зураач", "79");
medeelel("Сараа", "багш", "89");
medeelel("Наранцэцэг", "вэб дизианер", "96");
medeelel("Өсөхөө", "программист", "98");

// var name = "Болд";
// var job = " зураач";
// var avgDun = 92;
// Дээрх өгөгдлийг доорх жишээнд arguments руу хийж өглөө.

function medeelel(name, job, avgDun) {
  // prametr эсвэл arguments гэдэг алинграа хэлж болно.
  switch (job) {
    case "багш":
      console.log(name + "бол багш юм.");
      console.log(name + " бол хүүхдүүдэд хичээл заадаг.");
      break;
    case "зураач":
      console.log(name + " гое зураг зурдаг.");
      break;
    case "вэб дизианер":
    case "программист":
      console.log(name + " бол вэб програм зохиогч юм");
      break;
    default:
      console.log(name + " бол өөр ямар нэг ажил хийдэг юм байна. Бүү мэд...");
  }

  switch (true) {
    case avgDun >= 90:
      console.log(name + " бол онц сурлагтан.");
      break;
    case avgDun < 90 && avgDun >= 80:
      console.log(name + " бол сайн сурлагтан.");
      break;
    case avgDun < 80 && avgDun >= 70:
      console.log(name + " бол дунд сурлагтан.");
      break;
    default:
      console.log(name + "  бол муу сурлагтан.");
  }
}
