// learn 20 For давталт, давхар давталт ашиглах

// loop -> Давталт Хамгийн энгийн хамгийн түгээмэл for давталт англиар (ийм байхад давт)

/*loop syntaxs
for ( A; B; C ) {
     A; Эхлэхдээ ямар утгатайгаас эхлэхийн зааж өгнө. Эхлэх нөхцөл
     B;  Ямар нөхцөл хангах хүртэл явахыг зааж өгнө. Дуусах нөхцөл
     C давталт болгон дээр яаж өөрчлөх вэ гэдгийг бичиж өгнө.
     {} буюу одоо энэ мөрийг бичсэн дотор давтах үйлдлээ бичиж өгнө.
}*/

for (var i = 0; i <= 3; i = i + 1) {
  console.log(i + "-р алхам");
  console.log("Дараачийн тоо нь " + (i + 1));
}
for (var i = 0; i <= 10; i = i + 2) {
  //10 доторх тэгш тоо хэвлэж байна.
  console.log(i + " тэгш тоо ");
}
for (var i = 1; i <= 10; i = i + 2) {
  //10 доторх сондгой тоо хэвлэж байна.
  console.log(i + " сондгой тоо ");
}
for (var i = 100; i <= 10; i = i + 2) {
  //10 доторх сондгой тоо хэвлэж байна.
  console.log(i + " сондгой тоо ");
}
for (var i = 100; i > 0; i--) {
  if (i % 7 === 0) console.log(i + " = 7 хувааддаг тоо.");
}

// Давхар давталт 
for (var i = 5; i > 0; i--) {
  // console.log(i)
  var s = "";
  for (var j = 1; j < i; j++)
    s = s + j + " ";
  {
    console.log(s);
  }
}

// Давхар давталт 
for (var i = 5; i > 0; i--) {
  // console.log(i)
  var s = 0;
  for (var j = 1; j < i; j++)
    s = s + j
  {
    console.log("1 ээс " + i + "хүртлэх тооны нийлбэр : " + s);
  }

}
