// learn 21 while, do while давталт

/*for давталт
for давталт давтах юм нь тодорхой үед хэрэглэдэг.
жишээ нь: чи 10 суниагаадахдаа гэвэл for давталт ашиглана. Тодорхой 10 суниах юм чинь гэх мэт*/

/*While давталт /тэгэх ингэх зуур /                                     1. өгөгдлийн сангаас өгөгдөл уншихад
жишээ нь: За чи намайг одоо болно гэж хэлтэл суниаж бай                        Сэрвэрээс илгээх өгөгдөл дуустал
while syntax                                                            2. Файлаас өгөгдөл уншихад 
while (энэ нөхцөл үнэн бол давт){                                              Энэ файлын төгсгөл тулчаагүй л бол цааш нь унш
    давтах үйлдэл 1                                                     3. Тоглоом дээр хүнийг гарах хүртэл ажиллах 
    давтах үйлдэл 2                                                            Тоглогч ESC товч дартал тоглоомыг үргэжлүүлэх. 
    ...
}         */
var i = 1;
while (i <= 5) {
  console.log(i);
  i = i + 1;
}

var command = "";
while (command !== "quit") {
  command = prompt("За та командаа оруулна уу ");
  console.log("Эхний давталт  : " + command);
}
console.log("За баяртай");

// while давталтын бас нэг хувилбар
var command = "";
do {
  command = prompt("Цаашаа суниахуу "); // энэ давталт юугаараа ялгаатай байгаа вэ гэвэл нөхцөл нь хойноо байгаа болохоор
  alert("Суниалаа : " + command);
} while (command !== "esc");
console.log("За баяртай");
