// learn 22 Давталтыг break, continue операторуудаар удирдах

// Массив дотороос 7 хуваагдах тоо хайх
// Массивын элемент болгоноор давтал хийж олно.
// continue -> үргэжлүүлэх = Ямар тохиолдол хэрэглэх вэ гэвэл энэ жишээнд 7 хуваагдахгүй байвал үргэжлүүэх гэж байна.

// watch-> харах = Цонхны тухай too[i] сонгож байгаад mouseны баруун товчлуурыг дараад  add to watch гэсэн командыг сонго
var too = [12, 13, 17, 90, 21, 65, 32];
for (var i = 0; i < too.length; i++) {
  if (too[i] % 7 !== 0) continue;
  console.log(too[i]);
}
