// learn 23 Утган хандалт болон заагч хандалтын тухай - value VS reference

// Утга олголт:  1. энгийн утга олголт буюу value  ===> утгын өөрчилөхөд хуулбар нь дамждаг байгаа.
//               2. заалтаар утга олголт буюу reference ===> утгын өөрчилөхөд  өөрөө дамждаг байгаа.

////////////////////////////////      1. энгийн утга олголт буюу value        ////////////////////////////////////////////////
// primivite өгөгдлийн төрлүүд дандаа ийм байдлаар утгууд нь copy байдлаар утгууд нь дамжигддаг.
var a = 12; //а-гын утгыг b өгөхөд санах ойд байгаа хаягнаас а-гын хуулбар буюу copy дамжигддаг
var b = a; // а-гын утганы хуулбар ирэээд санах ойд а-гын хаягнаас өөр хаяг дээр b  болон хадгалагддаг.
a = 13; // ийм учираас а-гын утгыг 13 болоход b-гын утга өөрчлөхдөхгүй. Ягаад гэвэл санах ойд 2 өөр хаяган дээр байгаа болохоор
console.log(a);
console.log(b);

///////////////////////////////      2. заалтаар утга олголт буюу reference     /////////////////////////////////////////////
//----------- 2а. Объектод заагч утга ашиглах: Object Reference-------------------------------------------------------------
var p1 = { name: "notebook", price: "300$" }; //p1 утгыг p2 өгөхөд p1 өөрөө дамжигдаж байна.
var p2 = p1;
p2.price = 120000; // утгууд өөрөө дамждаг p1 p2 -ын алингийн ч name, price утгыг солиход 2ууллаа өөрчилөгдөж байна.
p1.name = "shoes";
console.log("p1 = " + p1.name + " " + p1.price);
console.log("p2 = " + p2.name + " " + p2.price);
//-------2b. Массивд заагч утга ашиглах: Array Reference--------------------------------------------------------------------
var x = [2, 6, 10]; // Объектодтой ижил нэг хаягыг зөөж байна.
var y = x;
y[0] = 50;
x[3] = 7;
console.log(x);
console.log(y);
//----- 2c. Функцад заагч утга ашиглах: Function Reference------------------------------------------------------------------
var name = "notebook";
var price = 300000;
info(name, price);
console.log(name + "ны үнэ : " + price);
function info(name, price) {
  console.log(name + " нэртэй бүтээгдэхүүн " + price + " үнэтэй байснаа ");
  price = price - 5000; //буцаагаад өөррүү хадгалаад хэвлэхэд 5000 хасагдсан утга хэвлэж байна.
  console.log(price + " болж хямдарлаа  ");
}
//-----2d. Функцруу объект байдлаар хйиж утгыг өөрчилж үзэцгээе. Function+Object+Reference------------------------------------
// функц дотор объектоор утга дамжуулж байгаа тохиолдолд маш болгоомжтой дамжуулахгүй бол функц дотор утгыг өөрчилөхөд дамжуулсан объек дотор утга өөрчилөгдсөн байдаг. Маш олон мөр кодонд энэ 2 өөр өөр газар байж болно. объекын утгыг өөрчлөхөд функцын утга өөрчилөгдөөд байна. мөн функцын утгыг өөрчлөхөд объекын утга өөрчилөгдөөд байна.
var product = { name: "shoe", price: "15000" };
infoNew(product);
console.log(product.name + " бүтээгдэхүүний үнэ : " + product.price);
function infoNew(p) {
  console.log(p.name + " нэртэй бүтээгдэхүүн " + p.price + " үнэтэй байснаа ");
  p.price = p.price - 2000;
  console.log(p.price + " болж хямдарлаа  ");
}
