// learn 26 Javascript хэл дээр жишээ алгоритмын бодлогууд бодоцгооё

/* Бодлого: 1 
 1-1000 хүртлэх тооны нийлбэр ол  1. Бодох алгоритм
Нийлбэр хадгалах sum гэдэг хувьсагчид 0 гэсэн утга эхлээд өгнө.
1 - 1000 хүртэл давтаж бүх тоог уг SUM тоон дээр нэмнэ.  SUM тоог үзүүлнэ. */
var sum = 0; var limit = 1000;
for (var i = 1; i <= limit; i++) {
    sum = sum + i
    // console.log(i + '. sum = ' + sum);    //хаалтан дотор i хэвэлвэл 1-10 хүртэл тоог хэвлэн 
    // console.log(sum);         // 1-10 хүртлэх тооны нийлбэрийг тус бүр давтаж байгаа үед нь хэм харуулж байна. 
}
console.log("1-1000 хүртлэх тооны нийлбэр " + sum);
// Бодлого: 2 
// 1-1000 хүртлэх тоонуудаас 7-д хуваагдаад, хуваагдсан тоонуудын нийлбэр ол  
var sum1 = 0
for (var i = 1; i <= 1000; i++) {
    if (i % 7 === 0) {
        sum1 = sum1 + i
    }
}
console.log('1-1000 хүртлэх тоонуудаас 7-д хуваагддаг тоонуудын нийлбэр ' + sum1)

// Бодлого: 3
// 1-1000 хүртлэх ахны тоо ол 

for (var i = 2; i <= 100; i++) { // console дээр хардуулахын тулд 1000 ийг 100 болголлоо.
    if (anhniiTooMon(i) === true) console.log(i + " тоо бол анхны тоо мөн ");
}
function anhniiTooMon(too) {
    var anhniiTooMon = true;
    for (var x = 2; x < too; x++) {
        if (too % x === 0) {
            anhniiTooMon = false;
            break;
        }

    }
    return anhniiTooMon;
}