// 29 Javascript хөшигний цаана - Функц доторх функц, хувьсагч функцийн үзэгдэх орчин буюу scope

// Функц доторх функц ...

function sayHello() {
  var friend = "Сараа";
  howDoYouDo();
  function howDoYouDo() {
    console.log("how do you do " + friend); // friend хандаж болно.
  }
}
// Дахин дахин давтагдсан кодыг нэг дор болгож бичээд тэгээд функцаа дараа дахин дахин дуудах замаар кодыг үр ашигтай бичдэг Dry буюу Dont Repeat Yourself зарчмийг хэрэгжүүлэхэд функцаар хэрэгжүүлдэг.
 1. Функц нь Глобаль