// learn 30 Кодын ажиллах Execution context болон Execution Stack-ийг ойлгох

/*
1. Execution context 
2. Global execution context 
3. Execution Stack талаар үзэцгээе. javascript код цаанаа яг яаж ажилдаг вэ. 

 Execution ===> Програм ажлуулах 
 Execution context  ===> Програм ажлуулдаг орчин */
Javascript-ын функц бүрийг ажиллахад түүнд зориулагдсан ажиллах орчин буюу Execution context javascript engune үүсдэг. Дөрөв таван функц дарааллаад ажиллавал дөрөв таван тусдаа Execution context үүсдэг. Тэгэхээр  нэг Execution context дотор доорх хувьсагч объект, This тусгай хувьсагч, SCOPE CHAIN гэсэн 3 зүйл байдаг. 

функцын   кодыг   ажиилах   орчин  -   Execution    Context 

varable object 
Хувьсагч объект      This тусгай хувьсагч          SCOPE CHAIN

Хувьсагч объект :
javascript кодыг parse хийгээд тэрэн дотороо  үг үсгийн алдаа шалгахаас гадна ямар ямар хувьсагч байна ямар ямар функц байна гэдгийг функцын кодноос хайж олдоод Хувьсагч объект дотор утыг нь хадгалах зай бэлддэг байгаа. Мөн уг функц дотор өөр ямар функцууд зориулагдсан байна тэдгээрийг  кодтой хамт Хувьсагч объект дотор бичиж бэлддэг байгаа. 
Эдгээр функцыг ажиллахаас өмнө функц дотор байгаа бүх хувьсагчидыг мэдээд санах ойд бэлдчихсэн байдаг. 
Хувьсагч объект бэлдэхдээ бүгдэндэн нь undefined  гэдэг тусгай утгыг олгодог байж байгаа. Тийм учираас хувьсагчид утга олгоогүй байхад хэвлээд үзэхээр undefined гэж гардаг. 

This тусгай хувьсагч :
функцын кодыг scan хийгээд parse хийгээд бүх хувьсагчид функцуудыг нь Хувьсагч объект бичсэний дараа  Тусгай тухайн функцад зориулсан This тусгай хувьсагчийг javascript engune үүсгээд Execution context-той холбож өгдөг байгаа 
This тусгай хувьсагч - энэ функцыг ямар объект агуулж байна  тэр объектыг нь энэ THIS гэдэг хувьсагч зааж байдаг.  Энэ функцын өөр нэг объектын функц байдлаар хийгдсэн бол this гэдэг тэр объектыг заах нь байна. THIS ээр нь дамжуулаад тэр объектын өгөгдөл болон агуулж байгаа объектын өгөгдөл болон  бусад функцуудыг дууддаг. Энэ бол эх объектруу хандах тусгай заагч хувьсагч гэж ойлгож болно. 

SCOPE CHAIN: эх функцынхаа өгөгдөлрүү хандахад SCOPE CHAIN ашиглана.