// learn 36. Вэб апп #1 - Сонирхолтой тоглоом апп

/*
Гуравдугаар бүлгээр юу юу үзэх талаар ярилцах 

1. HTML, CSS товч танцуулаг 
2. Git суулгах, ашигалах,  үндсэн командууд
3. DOM гэж юу вэ?
4. Евент хандлер гэж юу вэ
5. DRY зарчим
6. Git branch үүсгэх, вэб апп дээр хэрхэн өөрчлөлт хийх вэ
7. Git ашигалан бичсэн кодоо github дээр байрлуулах 
8. Хийсэн вэб аппаа интернэтэд байрлуулах*/

// DOM гэдэг бол javascript хэлүүдээс вэб сайтыг өөрчилөхөд зориулсан broser-ын санах ойд бүтэц бэлдэж өгнө. Өөрөөр хэлбэл веб санах ойдох хэлбэр нь юм.
