// learn 37. git гэж юу вэ? gitbash суулгах

/*Git гэж юу вэ? 

Файлын өөрчилөлтийн түүхийг удирдах систем
2005 онд Linus Trowald зохиосон. (Linux-ийг бүтээгч)

    -Дараах зүйлийг хийдэг: 
            -Файлын өөрчилөлтийн түүх ( change history )
            -Файл дээрх хамтын ажиллагааг боломжтой болгох (collaboration )
            - Нэг Файлын өөр өөр хувилбаруудыг үүсгэж тусд нь ажиллах боломж (Feature Branches) 
            
MAIN буюу master branch бол онлайнд байж байхад test branch үүсгэж янз бүрийн тестэлж, туршиж үзээд болсон хойноо master branch руугаа нийлүүлдэг.  тест Branch-ын дор devoloper branch ч үүсгэж болно.  devoloper branch аас дахиад branch үүсгэж авч болдог.
нэг master branch дор 20 30 ч branch үүсэх боломжтой.  

-Файлын өөрчилөлтийн түүх ( change history ): SAVE командаар хийсэн өөрчлэлтийг уг файлыг хаасны дараа буцаан өмнө байснаар нь сэргээх болмжгүй байдаг. Git нь ямар ч цаг үеээр нь хамаагүй буцаан сэргээх боломжтой SAVE боломжийг өгдөг.  7 жилийн өмнөх файлаа ямар commit байсантай хамт гаргаж ирэх боломжтой. 
Олон хүн нэг файл дээр ажиллаж байхад GIT нь 
    -Хэн хэзээ уг файлын хаана нь юуг нь яаж өөрчилснийг хэлж өгнө. 
    -Уг өөрчлэлтийг хийхдээ тэр хүний бичсэн тайлбар тэмдэглэлийг үзүүлнэ. 
    -Аль ч хугацааны үед уг файлын ямар байснаар нь буцаан сэргээн гаргаж ирж чадна.
    
-Файл дээрх хамтын ажиллагааг боломжтой болгох (collaboration ): Олон програмистууд нэг файлын өөр өөр хувилбар дээр ажиллах боломжийг GIT өгнө. 
Дараа нь уг Файлын өөр өөр хувилбаруудыг автоматаар нэгтгэж өөрчлөлтүүдийг нийлүүлж өгдөг. 

Нэг Файлын өөр өөр хувилбаруудыг үүсгэж тусд нь ажиллах боломж (Feature Branches): Git -ийг зөвхөн програмистууд ашигладдаггүй. Энэ бол файлын өөрчлөлтийн түүхийг ашигладаг болохоор.

git системтэй харилцахдаа 
    gitbash гэсэн тусгай програм ашиглаж болно. 
    Microsoft VS Code маань мөн git-тэй ажиллах Plugin суулгаад ажиллах боломжтой. */

/************************** Gitbash суулгацгааж тохируулцгаая ********************/

/*Shell command prompt ашиглаад сурчихсан хамаагүй илүү 
Shell - орчин үеийн бараг л бүх л үйл ажиллагаа command prompt командаар хийддэг болсон байгаа. Жишээ нь: javascript devoloper npm сайтаас төрөл бүрийн Plugin, open course, labarary татаж авахаас гадна  суулгаж байна. command prompt ажиллуулж системээ ажиллуулж байна. Веб pack ашиглаад бүгдэнг нь bild хийж compileдахад  command prompt  хэрэглэж байна. Bable ашиглаж бүгдэнг нь css, javascript compileдаж Transform хийхэд command prompt ашиглаж байна. Бүх зүйл дээр command prompt ашиглаж байна.  https://git-scm.com/downloads

Суулгаж дуусаад ажилуулаад 
start . гэсэн команд өг Home Drector гаргаж ирнэ. terminal-config гэсэн хавтасан байгаа 2 файлыг хуулаад нэрнийх нь урд цэгтэй хадгал 


Хадгалагдахгүй бол shell дээрээ ингээд хадгал  
mv terminal-config .terminal-config
mv bash_profile .bash_profile*/
