// learn 40.HTML CSS бичиж үзэцгээе!

// * бол бүх таганд нөлөөлдөг

/* HTML нь хоёр child: -тэй <head> болон <body> гэсэн javascript-д хэдэн child-тэй байгааг тоолдог програм байдаг. 

head: бол нүдэнд харагдахгүй нэмэлт мэдээлэл өгдгө таг. Хайлтын систэмийн engune -үүдэд хэрэгтэй. Жнь Google болон интернетийн автомат робот програмууд байдаг тэдгээрүүд head доторх мэдээллүүдийг уншаад интернет дотор индекслэж энэ вэб хуудас энэний тухай юм байна гэж мэдээллүүдийг хадгалдаг бөгөөд хайлтын систэмээр хайхад head дотор бичсэн мэдээлийг ашиглаж хуудасыг хайлтын систэмд гаргаж өгдөг байгаа.

body: гэдэг нүдэнд харагдах хэсэг буюу их бие, дотор хичнээн таг байж болно. */

/* HTML --> <head> -> <title>
                     <body> ->  <h1>
                            -> <p> -> <img>
                            -> <P1> -> <b> html гэнэ. Javascript HTML дээр өөрчлөлт хийдэггүй. 

document -> HTML --> <head> -> <title>
         <body>   ->  <h1>
                  -> <p> -> <img>
                  -> <P1> -> <b>
                         -> <a> гэх мэт энэ объектийг DOM гэдэг. DOM -оор Javascript ;дамжиж хайлт хийж байгаад өөрчлөлт хийдэг. Өөрчлөлт хийхээс гадна энэ гарсан өөрчлөлтийг уншиж авдаг. Мөн энэ дээр шинээр child -уудыг залгаж чадна. Жнь facebook-ын мэдээлэл доош нь гүйлгээл дуусангуут дараагын мэдээллийг залгааал яваад байдаг. Хязгааргүй олон contant-ыг facbook-ын үзэж байхад залгаал үзүүлчихдэг 
Жшээ нь: Facebook цаанаас HTML гэсэн юм ирлээ гэж бодоход broser хүлээж аваад  хадгалаад авахыг DOM гэнэ. 
javascript болон динамик хэлнүүдэд вэб сайтыг өөрчлөхөд тусалсан объект гэж хэлж болно. 

                            
*/
// body {
//     background-color: green;
//   }

//   .greenDiv {
//     color: white;
//     background-color: green;
//     font-size: 28px;
//     padding: 20px;
//     border: 10px solid white;
//     margin: 20px;
//     font-family: "Segoe UI", Tahoma, Geneva, Verdana, sans-serif;
//   }
