// learn 41. DOM руу хандаж үзэцгээе!

/* window болон document гэсэн 2 объект талаар үзнэ. Ялгааг харах болно. 

DOM гэж юу вэ? 

DOM : Document object Model 
    Вэб хуудас ачаалахад брузер дотор үүсдэг. 
    Вэб хуудас дотор бүх өгөгдлийг агуулсан санах ойд байдаг объект юм. 
    HTML таг бүрт харгалзах объектыг DOM  дотор үүсдэг. 
    Уг DOM объектыг нь Javascript-ээр өөрчлөх замаар вэб дээрх мэдээллийг өөрчилдөг. 

 HTML --> <head> -> <title>
                     <body> ->  <h1>
                            -> <p> -> <img>
                            -> <P1> -> <b> html гэнэ. Javascript HTML дээр өөрчлөлт хийдэггүй. 

document -> HTML --> <head> -> <title>
         <body>   ->  <h1>
                  -> <p> -> <img>
                  -> <P1> -> <b>
                         -> <a> гэх мэт энэ объектийг DOM гэдэг. DOM -оор Javascript ;дамжиж хайлт хийж байгаад өөрчлөлт хийдэг. Өөрчлөлт хийхээс гадна энэ гарсан өөрчлөлтийг уншиж авдаг. Мөн энэ дээр шинээр child -уудыг залгаж чадна. Жнь facebook-ын мэдээлэл доош нь гүйлгээл дуусангуут дараагын мэдээллийг залгааал яваад байдаг. Хязгааргүй олон contant-ыг facbook-ын үзэж байхад залгаал үзүүлчихдэг 
Жшээ нь: Facebook цаанаас HTML гэсэн юм ирлээ гэж бодоход broser хүлээж аваад  хадгалаад авахыг DOM гэнэ. 
javascript болон динамик хэлнүүдэд вэб сайтыг өөрчлөхөд тусалсан объект гэж хэлж болно. 


Javascript window VS document объект

javascript-ийг брузер дотор ажиллаж байхад 
        - globalThis глобаль объект нь window объект байдаг. 
        - WINDOW объект дотор вэбийн нүдэнд харагдах хэсгийг хариуцдаг DOCUMENT объект байрлана. 
        -WINDOW нь глобаль объект тул window.document эсвэл шууд document гэж хандах нь ялгаагүй байдаг.  */
