// 54.Функцийн this заагчийг өөрчлөх, bind , call, apply функцүүд, функц зээлэлт

// Фунц доторх this заагч
/* Фунцийг бичээд доторх this заагчыг ашиглах юм бол энэ this заагч нь функц
 дотор window объетийг буюу глобал this объетийг зааж байдаг. Өөрөөр хэлбэл 
 глобал утгийг заасан байдаг. Функцын доторх this заагчыг өөрчлөх боломжтой.
 Функцын тусгай bind, call, apply зэрэг функцууд ашиглан хэрэгжүүлэх боломжтой.
/*
 function hi(){
   console.log('sainuu');
 }
 1)hi.2)__proto__.3)__proto__.4)__proto__
//  1. functtion  
//  2.бүх фунцад удамшсан эх функц байдаг. = функц болгонд ямарч хамаагүй загвар буюу эх функ байдаг. Тэрэн дотол bind, apply, call гэсэн функцуудыг бичээд өгчихсөн байдаг.    
//  3. object буюу дотор tostring объет байгаа   
//  4. null */

/* This функц дотор байх юм бол глобал объектыг заадаг.
Объект дотор байх юм бол this тэр объектынхаа дотор зарлагдсан өгөгдлүүдийг заадаг*/

/*Объект*/
var img = {
  file: "c:/image/a123.jpg",
  content: " муур",

  zuragTanih: function (color, size) {
    console.log(
      "Энэ зураг дээр " +
        color +
        " өнгөтэй " +
        size +
        " хэмжээтэй " +
        this.content +
        " байгаа нь танигдлаа. "
    );
  },
};

img.zuragTanih("хар", "жижиг");

var myImg = {
  file: "c:/image/a596.jpg",
  content: "нохой",
};
// BIND  function currying
/*Method bro Функцын зээлэлт хэрхэн bind ашиглах харуулах
   -bind гэдэг функцийг хуулбарын-гийн үүсгээд this 
  заагчынх нь оронд шал өөр утга дамжуулдаг
  -bind өөр бас нэг хэрэглээ бол функцыг defualt утга өгөөд дуудах боломж олгодог. Энийг function currying гэдэг. Доод талынн mySuperZuragTanihFunction(); өөрчилөөд байж болдог. 
  */

var mySuperZuragTanihFunction = img.zuragTanih.bind(myImg, "шар", "том");

mySuperZuragTanihFunction();

/* -call бол bind-аас төстэй зүйл хийдэг боловч фунцыг өөрийг дууддаг дуудахдаа үе дээрээ tsis заагчийг нь өөрийнхөөрөөө солид явчих боломжтой. 
   Энэ хоёрын ялгаа нь гэвэл bind нь  mySuperZuragTanihFunction нэрийг өөрчилж байгаад дуудаж байгаа бол call нь шууд zuragTanih цункцыг дуудад this өөрчилж байна. call-н бас нэг боломж нь аргемент хүлээж аваад шууд хойноос залгаал дажуулчихдаг.*/

img.zuragTanih.call(myImg, "цагаан", "үлэмж");

/* -apply бол call адилхан боловч дамжуулж байгаа аргеиантуудыг нь массивд хийчихсэн байдаг.  */

var args = ["ягаан", "аврага"];
img.zuragTanih.apply(myImg, args);
