// learn 84.Блок хандалт болон IIFE кодын хамгаалалт, өгөгдлийн хамгаалалт.

var name = "Болдоо";
var age = 33;
console.log(name + " нэртэй хүн " + age + " настай.");
/******************************************************/
(function () {
  var name = "Баяраа";
  var age = 45;
  console.log(name + " нэртэй хүн " + age + " настай.");
})();
/******************************************************/
{
  // өгөгдлийн далдлалт хийж өгч байгаа нь энэ.
  let name = "Цэцгээ";
  let age = 21;
  const address = "ub";
  console.log(name + " нэртэй хүн " + age + " настай.");
}
/******************************************************/
console.log(name + " нэртэй хүн " + age + " настай.");
