// learn 97. Асинхрон болон синхрон код гэж юу вэ?

// Асинхрон код: Парлель буюу зэрэг ажилладаг процессыг нэрлэдэг.
// Синхрон код: Дараалж ажилладаг процессыг нэрлэдэг.

// Функцын хувилбарууд хоорондоо ямар ямар ялгаатайг олж мэд.
const first0 = () => {
  // энэ бол ES6 дээрх Arrow буюу суман функцын бичиглэл.
};

function first1() {
  // энэ бол function statement .
}

var first2 = function () {
  // энэ бол function expression.
};

const first = () => {
  console.log(`Нэгдүгээр функц : Сайн байна уу `);
  second();
  console.log(`Нэгдүгээр функц : Баяртай `);
};
const second = () => {
  setTimeout(() => {
    console.log(`Хоёрдугаар функц : Асинк кодоос мэндчилж байна...`);
  }, 5000);
};
first();
